[
  {
    "ID": 0,
    "Title": "The Story of Nykaa",
    "Author": "Agaash",
    "Creds": "Mech 24'",
    "Date": "3 October, 21",
    "Day": "Wednesday",
    "Content": "How much do you think about fashion and makeup? Well, maybe a lot or not at all. Whether we see it or not the beauty industry today is worth more than $511 billion dollars and our clothes & accessories have often become a symbol of status and worth. What if I told you that a women from a Gujarati family with sky-high visions decided to find a backdoor to the beauty industry and completely disrupted it. You have probably already seen the title of the video and yes, today we are going to speak about Nykaa and the woman behind it.<br /><br /><b>PART ONE: FALGUNI?</b><br /><br />The story of Nykaa begins with the infamous woman behind it, Falguni Nayar. Falguni was born and brought up in Mumbai by a Gujarati family. Her father owned a  ball-bearings company and hence she grew up in an entrepreneurial environment where the stock market and trade was common dinner conversation ever since she was young. Growing up under her father's influence, Falguni obviously got interested in entrepreneurship and commerce. This passion made her enter business school and pursue a degree from IIM Ahmedabad. and immediately after completing her degree Falguni started working at A F Ferguson & Co. In 1993, Falguni decided to quit her job at Ferguson to join Kotak Mahindra Group where she spent 19 years in various roles in the company. During her time in Kotak, Falguni witnessed and helped a lot of companies in going public.Her job in Kotak as investment banker was to help startups go public and she always felt that startups where intoxicating and gave life a sense of adventure.However Falguni’s financial situation at that time made her go to a well paid job as she couldn’t afford taking risks just yet as she had the responsibility of taking care of her kids. Here is where things get a little interesting it was 2009 and Falguni was almost 50. Her kids had completed their schooling and were leaving to the United States for higher studies and Falguni had risen from a mere investment banker to the capital investment managing director in Kotak. She was supposed to be fulfilled at this point, but she felt a call for adventure. The job at Kotak wasn’t challenging for her anymore and Falguni always dreamt of being an entrepreneur.Hence Falguni started brainstorming different business ideas she could undertake and realized that the beauty market in india was almost non-existent.This was not the case in other countries like japan and USA.She noticed companies like Sephora which was an US based beauty product retailer and got inspired for creating a similar business in India but was the dream alone enough to quit a stable job. According to her peers,She had already reached the end of her professional career but Falguni wanted to be an adventurer hence she made the bold call of quitting her job in 2012 to start something on her own. When asked Falguni about how she made this bold decision she replied 'I was never a good swimmer but I would always be the first to jump in'.Falguni was now economically settled but did not have enough capital to start and scale a business on her own but she still decided to give it a shot with the limited resources she had. Growing up she loved makeup a lot and saw a huge opportunity to build an e-commerce based beauty venture. Therefore in April 2012,' Nykaa' derived from the word 'nayika' which means the actress of one’s life, started its journey. In april of 2012 Nykaa began and Falguni was it’s only employee.<br /><br /><b>PART TWO: SOLID BEGINNINGS</b><br /><br />When Nykaa was launched people in the startup ecosystem had mixed reactions. This is because beauty was not really a huge market in India back in 2012. Falguni was aware of this fact but she saw this as a huge opportunity. According to Falguni in countries like the United States beauty brands dominated the ground floors of every mall she ever visited and was seen as a necessity rather than a luxury. This was not the case when it came to India at least not in 2012. The real question was why was it that way? I mean by 2012 India wasn’t really what you would consider an economically backward country. The reason had to be something else and Falguni felt she had cracked the code. Falguni knew that women, in general, admired makeup but felt that there was a lack of education/information about makeup, brands, tutorials, or anything else in that field. In order for Nykaa to work the platform should not just be the amazon for beauty products but had to be an experience where people learned more and more about 'beauty' and also happened to buy cosmetics on the same platform. Falguni and her small team back then wanted to create 'the girl’s best friend' and not another e-commerce platform. This obsessive focus on the customer distinguished Falguni and her team from their competition.<br /><br /><b>PART THREE: GROWTH AND MORE GROWTH!</b><br /><br />Nykaa was well received by the market unlike most startups but this did not stop Falguni from adding more inventory every month. This meant not only adding more brands of the same product but also adding more categories to cover the sea of choice which was available in the world of cosmetics. These expansion plans obviously needed a lot of capital and Falguni was left with a choice to die slow or grow fast. Falguni being the smart woman she is chose the latter. After growing about 100% every year, Nykaa decided to start raising capital from HNI’s and NRIs from July 2014. Falguni had no plans of pressing the brakes but she thought it was finally time to solve the ick they had with their profit margins.<b><br /><br />PART FOUR: BUSINESS MODEL?</b><br /><br />Nykaa did grow 100% every year, well at least in revenue but Falguni knew that the retail margins per every sale were too small to grow a business of scale. Nykaa was earning about 10-20% of the profit from every sale and this was as high as they could go when it came to e-retail. Why? Well, Nykaa uses the inventory model of e-commerce which means that Nykaa owns its warehouses and controls its distribution. This was the only way Falguni was able to think of to make sure that the products delivered were fresh and not expired. The biggest fear of every consumer of cosmetics was acquiring expired and unlicensed products and this fear quadrupled when it came to buying cosmetics online as the consumer had no control over the products being delivered or the product’s expiry dates. Falguni noticed this in the early days of Nykaa and hence structured Nykaa in a way that fresh and new products were the ones that always reached the doorsteps of the consumer. Of course, having an inventory-based model also meant that Nykaa got to enjoy better profit margins by having complete control of the distribution process. Falguni was able to kill two birds with one stone with clever models like this. Falguni and her team were building a brand of trust and comfort and were trying their best to become what they called 'the girl’s best friend'.<br /><br /><b>PART FIVE: NYKAA FASHION,NYKAA MEN AND MORE!</b><br /><br />Falguni was always living 2 years in the future when it came to Nykaa.By the time the rest of the world addressed the fact that Nykaa is now a Direct to customer product company,Falguni and Adwaita had already laid plans for Nykaa’s expansion to fashion and launch for a separate platform called Nykaa men.These expansion plans were possible due to the immense interest that VC’s had to fund Nykaa.In March 2020 ,Steadview Capital invested $14 million (Rs.100 cr) for a valuation of $1.2 billion (Rs 85 billion) thus making it an unicorn. Bollywood also loved Nykaa,in October 2020 actresses Alia Bhat and Katrina kaif invested undisclosed amountrs in Nykaa through secondary funding. ",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 1,
    "Title": "Digital Marketing",
    "Author": "Shaurya Vaid",
    "Creds": "BMS 24'",
    "Date": "28 September, 21",
    "Day": "Tuesday",
    "Content": "The term “Marketing” did not develop today. It has existed in the world of business since time immemorial. Marketing has gained significance over the years and has become a branch of commerce which cannot be neglected. Most people reading this article would think of marketing as promotion. But it is a broader term that covers all activities ranging from production to selling to even after sales services provided to customers. Many agree with the fact that marketing is important but there is one question that came to my mind recently and made me rethink about the concept altogether: Is marketing the same even today? Can traditionally marketing strategies be used in modern e-businesses?<br /> <br /> <b>Disruption through Digital Marketing</b><br /><br /> I strongly believe that traditional marketing strategies like brand consistency, movement creation, and social strategy are still relevant but digital marketing is one term that has conquered the world of marketing of late. Digital marketing is a marketing technique that uses technology as a medium to reach out to consumers. Keeping the rapid technological advancement in perspective, digital marketing has become a sensation in the new marketing era. Especially today, when important activities like education and businesses have shifted online, marketing too has shifted to an online mode. Instagram and Facebook posters have replaced paper posters and pamphlets that were earlier distributed. Most start-ups as well as established businesses have considered social media as an asset to reach out to more and more consumers across the globe.<br /> <br /> Increased user engagement on social media platforms has broadened the consumer base of numerous organizations. Well established companies like Apple Inc. also use the online mode to launch their featured products like Apple Watch Series 6, iPhone 12 and the M1 chip. Digital marketing is spreading across the globe because it has proven to be an effective and advantageous form of marketing. Even start-ups that are relatively new to the market are adopting digital marketing strategies due to the cost benefits offered by such marketing styles. These small start-ups use their creativity to run different social media campaigns and use tools like YouTube and even Spotify Podcasts to establish their brand, leaving a long-lasting visual impression in the minds of their prospective consumers.<br /> <br /> <b>The dos and don'ts</b><br /><br /> While these digital marketing strategies are effective, they too require a lot of effort. Anything and everything cannot be posted on social media. You can neither post too much information nor can you boast too much about your product or service. A correct balance needs to be maintained between the nature of your content, beauty of your content, amount of content and the frequency of posting the content. Here are a few things which you need to keep in mind. Your digital marketing team must ensure that the content posted is short, crisp and related to the product or service that is being marketed. The content should be visually appealing and should have the ability to pull more and more consumers.Initially, the focus should be on grabbing attention and later, the focus should be on marketing the product. Interactive posts, stories and short videos tend to boost the reach massively.<br /> <br /> <b>What’s next?</b> <br /> <br /> While these are some digital marketing tips, this skill cannot be learnt overnight. Students interested in the field of marketing can take up digital marketing courses online on platforms like Udemy and Coursera to learn more about the various strategies. As is evident, this new form of marketing is expected to grow with advancement in technology in the coming years. Marketing plays a vital role in building a successful brand and must not be neglected. The world of marketing is dynamic and is undergoing changes, with new marketing strategies being developed every day. Changing with the environment is necessary to follow trends as well as to set new trends. Learning and implementing new marketing strategies is quite common in the field of marketing. While some strategies work for some organizations they sometimes do not work in other organizations. I strongly believe that the marketing space requires creative thinking and rightful implementation to create an immeasurable impact.",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 2,
    "Title": "Speculation or Strategy?",
    "Author": "Lavanya",
    "Creds": "Eng 24'",
    "Date": "7 October, 2021",
    "Day": "Tuesday",
    "Content": "Understanding short-selling is fairly simple as it essentially refers to a trading strategy that primarily relies on speculation made by the investor in the decline in a stock or a security price. It takes place when an investor at the time of trade sells shares that he does not own. In a short sale, with the help of a brokerage, the trader borrows shares from the owner and sells them at market prices, likely hoping that prices will fall and when the prices finally drop, the short seller acquires a profit from the shares and books. It is an advanced tactic that should be undertaken by experienced investors or traders only. <br /><br />Although it is arguably a huge risk made by the investors, it is often argued that while it may be a risk, it incurs a huge profit at times. Not only that, but it has also been approved by many market regulators as it ensures that the prices of the stocks are not easily manipulated by the promoters, as well as provides liquidity along with other countless benefits that help keep the economy run a little more smoothly. Short sellers are also often known for doing the job which is supposed to be done by the Securities and Exchange Commission in digging out the fraud. <br /><br />While it has its own pros, there are also cons. It may not always be ethical as the short sellers are essentially betting towards the downfall of companies and sometimes even the economy, like Charlie Ledley, the founder of Cornwall Capital, and his partner Jamie Mai for instance who were one of the first few people who shorted the subprime mortgage market before the 2007-2010 financial crisis caused by the collapse of the housing bubble. Although, there are some unethical short-selling tactics that should be curtailed, like the ‘short and distort’ schemes in which the sellers may try spreading lies and frame companies which they’re trying to short with false accusations to invariably push the stock down. <br /><br />Aside from the fact that it has its pros and cons, nothing comes without risk as mentioned before, and many of such risks are largely disruptive. In the short-selling business, margin trading is one of the huge factors which essentially refers to a kind of trading in which you borrow money from a broker while simultaneously using the collateral deal for security. By doing so, if you fail to return the fixed amount of money by a certain deadline, you are at risk of losing a huge asset. This can also happen in the case of returning security. Another factor to consider would be the market regulations, as in order to prevent panic, short sales, albeit approved by market regulators, can often endure a ban in a specific market at any time which ultimately can lead to a price spike. <br /><br />As Jesse Livermore said, The stock market is never obvious. It is designed to fool most of the people, most of the time. Nothing in the stock market is ever easy or ends well. It’s all about how much you’re willing to gamble it all and whether it would be worth it. Everything will always have its own advantages as well as disadvantages and this goes beyond the market as well, so it’s not always bad to take the risk because you just might never know when the economy might crash again.",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 3,
    "Title": "The New Wave Of Fashion",
    "Author": "Dhanya",

    "Creds": "Eng 24'",
    "Date": "4 Jan 2021",
    "Day": "Monday",
    "Content": "Almost every day when we open social media, be it Instagram, Pinterest, or even Twitter, we are greeted with new fashion trends adopted and promoted by our favourite influencers, content creators, and celebrities. Yesterday it was crop tops and today it’s oversized hoodies and tomorrow your feed will be filled with something else that you ‘have’ to buy in order to look ‘fashionable’. In order to conform to the million of aesthetics for our Instagram feeds, people have started buying clothes accordingly. <br /><br />The one industry that benefits from these forever changing trends is fast fashion. They produce clothes at a rapid pace to keep up with the new trends and make garments available rapidly to the masses. Stores like Fashion nova and SHEIN copy designs from expensive brands and sell their own low-quality versions at cheaper prices. These stores have certainly made the lives of many people who like to shop easier, but the real problem is the effect they have on our environment. Fashion- a $2.5 trillion sector is the second most polluting industry on the planet, right behind oil. In the past, the fashion industry followed four basic production seasons; spring, summer, fall, and winter. These traditional fashion seasons have now disappeared to accommodate the everyday production of garments based on emerging trends. According to Investopedia, it is common practice for retailers and manufacturers to introduce new products multiple times in a single week to stay on trend. <br /><br />The main reason to bring a radical change in the way that the fast fashion industry manufactures its products is the impact it has on our oceans, rivers, and lakes. Microfibers from manufactured textures are delivered into our streams — and, from that point, into our waterways, lakes, and seas — each time they are washed in our washing machines. The little size of the microfibers implies they are effectively ingested by fish and other natural life. <br /><br />Not only the environment but the labour working for these fast fashion corporations succumb to inhumane working conditions. According to a report by Global Labour Justice, the women workforce in supplier factories such as Gap and H&M in Asia suffer exploitation on a daily basis in the form of abuse, poor working conditions, unhygienic workplace, forced overtime, and low wages. Not less than a week ago, a female garment worker was allegedly killed by her supervisor after months of harassment at an H&M supplier factory in Tamil Nadu.<br /><br />The problems of buying from fast fashion brands are both environmental and ethical, but I cannot ask you to stop wearing what you want so here I am offering a few solutions for the next time you want to shop sustainably. To keep up with the latest trends, thrifting is a great option to reduce our carbon footprint and thrifted clothes are comparatively cheaper on a larger scale as compared to brand new clothes. So not only is thrifting good for the environment but also for your pocket! If you do not see thrifting to be fit for you, there are always sustainable homegrown brands available such as The Summer House and Chola the Label to name a couple. If you love fashion as much as I do, I hope you consider these new shopping avenues on your next shopping spree. Happy sustainable shopping!",
    "Share-Link": "GG",
    "Type": "Latest"
  }
]
