[
  {
    "ID": 0,
    "Title": "How is E-Cell helpful?",
    "Author": "Lavanya",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "The Entrepreneurship Cell of Shiv Nadar University aims to provide the students with an insight into the world of entrepreneurship. It provides the students with a platform to develop their entrepreneurial skills. Many opportunities, in the form of  regular meetings, games and fun events are there for the students of the club to enjoy and also hone their skills while working for the club. E cell works as an organized team which allows the students to not only develop their academics but also make them socially interactive and helps them to learn how to work in a team.  The different teams within the club also helps you explore your field of interest. Ecell provides many instances for you to ignite your entrepreneurial drive and also inspires you to choose entrepreneurship over jobs.",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 1,
    "Title": "Incubators vs Accelarators",
    "Author": "Ananya",
    "Creds": "3rd year ECE",
    "Date": "01/01/2022, Monday",
    "Day": "Monday",
    "Content": "If you ask anyone what an incubator is, they will most likely envision an apparatus in which environmental conditions can be controlled to artificially hatch eggs and an accelerator will, in most cases be defined as the foot pedal used in vehicles to control the speed of the engine Although both of these definitions are not technically apt with respect to entrepreneurial terminology, they can still be used to explain how incubators and accelerators actually work and what differentiates them from each other A business incubator helps start-up companies – generally at the idea stage – to overcome their initial hurdles by providing incubator services like management training or office space and by being a catalyst tool for economic development. A newly found start up generally lacks the resources to boost its growth at an exponential rate, so here is where incubators play a key role by providing them assistance, which is the hallmark of a business incubation programme. This can be easily explained by comparing ideas to eggs – you can bring it to life by placing it in an incubator. A good example of a start up incubator is the Atal Incubation Center which is set up at SNU. With a portfolio ranging from companies like QuarkMe to SNU on wheels, AIC displays its ability to provide access to start up companies to resources and mentorship which will further enable them to develop their idea into a business success story.",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 2,
    "Title": "What is a think thank? ",
    "Author": "Lavanya",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "Think-tank sessions serve as a bridge between where you are right now to where you aspire to be in your entrepreneurial journey. Exclusive to only the members of our club, these sessions provide crucial knowledge to all the budding members. We have hosted a spectrum of activities. These include start-up simulations, networking opportunities with industry experts, interactive games, brain-storming sessions and so much more!",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 3,
    "Title": "Cryptocurrency",
    "Author": "Ananya Panda",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 4,
    "Title": "The Process of Ideation",
    "Author": "Ananya Panda",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "Ideation is the creative approach of generating, creating, and imparting new thoughts. It contains all phases of an idea cycle and is an innovative way of solving the simple problem wherein several individuals through brainstorming. This approach of meeting problems provides strong focus on the users perception and their needs. Moreover, such a way equips one to creatively identify the demands in market and study the possible competitors in the market place.",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 5,
    "Title": "Start Up Culture",
    "Author": "Prabhav Pandey",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 6,
    "Title": "The Process of Ideation",
    "Author": "Ananya Panda",

    "Creds": "",
    "Date": "1 Jan 2021",
    "Day": "Monday",
    "Content": "",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 7,
    "Title": "NFTs and Digital Art",
    "Author": "Pratham  ",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 8,
    "Title": "Technology and the Pursuit of Knowledge",
    "Author": "Kanishk Chathley",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 9,
    "Title": "What is a think thank? ",
    "Author": "Aarushi",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 10,
    "Title": "Is EdTech the Future?",
    "Author": "Aryaman",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 11,
    "Title": "The Effect of COVID-19 on Sectors",
    "Author": "Prabhav Pandey",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  }
]
