[
  {
    "ID": 0,
    "Title": "How is E-Cell helpful?",
    "Author": "Lavanya",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "The Entrepreneurship Cell of Shiv Nadar University aims to provide the students with an insight into the world of entrepreneurship. It provides the students with a platform to develop their entrepreneurial skills. Many opportunities, in the form of  regular meetings, games and fun events are there for the students of the club to enjoy and also hone their skills while working for the club. E cell works as an organized team which allows the students to not only develop their academics but also make them socially interactive and helps them to learn how to work in a team.  The different teams within the club also helps you explore your field of interest. Ecell provides many instances for you to ignite your entrepreneurial drive and also inspires you to choose entrepreneurship over jobs.",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 1,
    "Title": "Incubators vs Accelarators",
    "Author": "Ananya",
    "Creds": "3rd year ECE",
    "Date": "01/01/2022, Monday",
    "Day": "Monday",
    "Content": "If you ask anyone what an incubator is, they will most likely envision an apparatus in which environmental conditions can be controlled to artificially hatch eggs and an accelerator will, in most cases be defined as the foot pedal used in vehicles to control the speed of the engine <br /><br />Although both of these definitions are not technically apt with respect to entrepreneurial terminology, they can still be used to explain how incubators and accelerators actually work and what differentiates them from each other <br /> <br /> A business incubator helps start-up companies – generally at the idea stage – to overcome their initial hurdles by providing incubator services like management training or office space and by being a catalyst tool for economic development. A newly found start up generally lacks the resources to boost its growth at an exponential rate, so here is where incubators play a key role by providing them assistance, which is the hallmark of a business incubation programme. This can be easily explained by comparing ideas to eggs – you can bring it to life by placing it in an incubator. <br /> <br />",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 2,
    "Title": "Digital Marketing - A Disruption",
    "Author": "Shaurya Vaid",
    "Creds": "BMS 24'",
    "Date": "28 September, 21",
    "Day": "Tuesday",
    "Content": "The term “Marketing” did not develop today. It has existed in the world of business since time immemorial. Marketing has gained significance over the years and has become a branch of commerce which cannot be neglected. Most people reading this article would think of marketing as promotion. But it is a broader term that covers all activities ranging from production to selling to even after sales services provided to customers. Many agree with the fact that marketing is important but there is one question that came to my mind recently and made me rethink about the concept altogether: Is marketing the same even today? Can traditionally marketing strategies be used in modern e-businesses?<br /> <br /> <b>Disruption through Digital Marketing</b><br /><br /> I strongly believe that traditional marketing strategies like brand consistency, movement creation, and social strategy are still relevant but digital marketing is one term that has conquered the world of marketing of late. Digital marketing is a marketing technique that uses technology as a medium to reach out to consumers. Keeping the rapid technological advancement in perspective, digital marketing has become a sensation in the new marketing era. Especially today, when important activities like education and businesses have shifted online, marketing too has shifted to an online mode. Instagram and Facebook posters have replaced paper posters and pamphlets that were earlier distributed. Most start-ups as well as established businesses have considered social media as an asset to reach out to more and more consumers across the globe.<br /> <br /> Increased user engagement on social media platforms has broadened the consumer base of numerous organizations. Well established companies like Apple Inc. also use the online mode to launch their featured products like Apple Watch Series 6, iPhone 12 and the M1 chip. Digital marketing is spreading across the globe because it has proven to be an effective and advantageous form of marketing. Even start-ups that are relatively new to the market are adopting digital marketing strategies due to the cost benefits offered by such marketing styles. These small start-ups use their creativity to run different social media campaigns and use tools like YouTube and even Spotify Podcasts to establish their brand, leaving a long-lasting visual impression in the minds of their prospective consumers.<br /> <br /> <b>The dos and don'ts</b><br /><br /> While these digital marketing strategies are effective, they too require a lot of effort. Anything and everything cannot be posted on social media. You can neither post too much information nor can you boast too much about your product or service. A correct balance needs to be maintained between the nature of your content, beauty of your content, amount of content and the frequency of posting the content. Here are a few things which you need to keep in mind. Your digital marketing team must ensure that the content posted is short, crisp and related to the product or service that is being marketed. The content should be visually appealing and should have the ability to pull more and more consumers.Initially, the focus should be on grabbing attention and later, the focus should be on marketing the product. Interactive posts, stories and short videos tend to boost the reach massively.<br /> <br /> <b>What’s next?</b> <br /> <br /> While these are some digital marketing tips, this skill cannot be learnt overnight. Students interested in the field of marketing can take up digital marketing courses online on platforms like Udemy and Coursera to learn more about the various strategies. As is evident, this new form of marketing is expected to grow with advancement in technology in the coming years. Marketing plays a vital role in building a successful brand and must not be neglected. The world of marketing is dynamic and is undergoing changes, with new marketing strategies being developed every day. Changing with the environment is necessary to follow trends as well as to set new trends. Learning and implementing new marketing strategies is quite common in the field of marketing. While some strategies work for some organizations they sometimes do not work in other organizations. I strongly believe that the marketing space requires creative thinking and rightful implementation to create an immeasurable impact.",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 3,
    "Title": "Cryptocurrency",
    "Author": "Ananya Panda",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 4,
    "Title": "Speculation or Strategy?",
    "Author": "Lavanya",
    "Creds": "English 24'",
    "Date": "7 October, 2021",
    "Day": "Tuesday",
    "Content": "Understanding short-selling is fairly simple as it essentially refers to a trading strategy that primarily relies on speculation made by the investor in the decline in a stock or a security price. It takes place when an investor at the time of trade sells shares that he does not own. In a short sale, with the help of a brokerage, the trader borrows shares from the owner and sells them at market prices, likely hoping that prices will fall and when the prices finally drop, the short seller acquires a profit from the shares and books. It is an advanced tactic that should be undertaken by experienced investors or traders only. <br /><br />Although it is arguably a huge risk made by the investors, it is often argued that while it may be a risk, it incurs a huge profit at times. Not only that, but it has also been approved by many market regulators as it ensures that the prices of the stocks are not easily manipulated by the promoters, as well as provides liquidity along with other countless benefits that help keep the economy run a little more smoothly. Short sellers are also often known for doing the job which is supposed to be done by the Securities and Exchange Commission in digging out the fraud. <br /><br />While it has its own pros, there are also cons. It may not always be ethical as the short sellers are essentially betting towards the downfall of companies and sometimes even the economy, like Charlie Ledley, the founder of Cornwall Capital, and his partner Jamie Mai for instance who were one of the first few people who shorted the subprime mortgage market before the 2007-2010 financial crisis caused by the collapse of the housing bubble. Although, there are some unethical short-selling tactics that should be curtailed, like the ‘short and distort’ schemes in which the sellers may try spreading lies and frame companies which they’re trying to short with false accusations to invariably push the stock down. <br /><br />Aside from the fact that it has its pros and cons, nothing comes without risk as mentioned before, and many of such risks are largely disruptive. In the short-selling business, margin trading is one of the huge factors which essentially refers to a kind of trading in which you borrow money from a broker while simultaneously using the collateral deal for security. By doing so, if you fail to return the fixed amount of money by a certain deadline, you are at risk of losing a huge asset. This can also happen in the case of returning security. Another factor to consider would be the market regulations, as in order to prevent panic, short sales, albeit approved by market regulators, can often endure a ban in a specific market at any time which ultimately can lead to a price spike. <br /><br />As Jesse Livermore said, The stock market is never obvious. It is designed to fool most of the people, most of the time. Nothing in the stock market is ever easy or ends well. It’s all about how much you’re willing to gamble it all and whether it would be worth it. Everything will always have its own advantages as well as disadvantages and this goes beyond the market as well, so it’s not always bad to take the risk because you just might never know when the economy might crash again.",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 5,
    "Title": "Start Up Culture",
    "Author": "Prabhav Pandey",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 6,
    "Title": "The New Wave Of Fashion",
    "Author": "Dhanya",

    "Creds": "English 24'",
    "Date": "4 Jan 2021",
    "Day": "Monday",
    "Content": "Almost every day when we open social media, be it Instagram, Pinterest, or even Twitter, we are greeted with new fashion trends adopted and promoted by our favourite influencers, content creators, and celebrities. Yesterday it was crop tops and today it’s oversized hoodies and tomorrow your feed will be filled with something else that you ‘have’ to buy in order to look ‘fashionable’. In order to conform to the million of aesthetics for our Instagram feeds, people have started buying clothes accordingly. <br /><br />The one industry that benefits from these forever changing trends is fast fashion. They produce clothes at a rapid pace to keep up with the new trends and make garments available rapidly to the masses. Stores like Fashion nova and SHEIN copy designs from expensive brands and sell their own low-quality versions at cheaper prices. These stores have certainly made the lives of many people who like to shop easier, but the real problem is the effect they have on our environment. Fashion- a $2.5 trillion sector is the second most polluting industry on the planet, right behind oil. In the past, the fashion industry followed four basic production seasons; spring, summer, fall, and winter. These traditional fashion seasons have now disappeared to accommodate the everyday production of garments based on emerging trends. According to Investopedia, it is common practice for retailers and manufacturers to introduce new products multiple times in a single week to stay on trend. <br /><br />The main reason to bring a radical change in the way that the fast fashion industry manufactures its products is the impact it has on our oceans, rivers, and lakes. Microfibers from manufactured textures are delivered into our streams — and, from that point, into our waterways, lakes, and seas — each time they are washed in our washing machines. The little size of the microfibers implies they are effectively ingested by fish and other natural life. <br /><br />Not only the environment but the labour working for these fast fashion corporations succumb to inhumane working conditions. According to a report by Global Labour Justice, the women workforce in supplier factories such as Gap and H&M in Asia suffer exploitation on a daily basis in the form of abuse, poor working conditions, unhygienic workplace, forced overtime, and low wages. Not less than a week ago, a female garment worker was allegedly killed by her supervisor after months of harassment at an H&M supplier factory in Tamil Nadu.<br /><br />The problems of buying from fast fashion brands are both environmental and ethical, but I cannot ask you to stop wearing what you want so here I am offering a few solutions for the next time you want to shop sustainably. To keep up with the latest trends, thrifting is a great option to reduce our carbon footprint and thrifted clothes are comparatively cheaper on a larger scale as compared to brand new clothes. So not only is thrifting good for the environment but also for your pocket! If you do not see thrifting to be fit for you, there are always sustainable homegrown brands available such as The Summer House and Chola the Label to name a couple. If you love fashion as much as I do, I hope you consider these new shopping avenues on your next shopping spree. Happy sustainable shopping!",
    "Share-Link": "GG",
    "Type": "Latest"
  },
  {
    "ID": 7,
    "Title": "NFTs and Digital Art",
    "Author": "Pratham  ",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 8,
    "Title": "Technology and the Pursuit of Knowledge",
    "Author": "Kanishk Chathley",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 9,
    "Title": "What is a think thank? ",
    "Author": "Aarushi",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 10,
    "Title": "Is EdTech the Future?",
    "Author": "Aryaman",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  },
  {
    "ID": 11,
    "Title": "The Effect of COVID-19 on Sectors",
    "Author": "Prabhav Pandey",
    "Creds": "GG",
    "Date": "GG",
    "Day": "GG",
    "Content": "GG",
    "Share-Link": "GG",
    "Type": "Archive"
  }
]
